{
  "0-20%": [
    "Her şey bir adımla başlar! Önemli olan denemen, gerisi zamanla oturacak.",
    "Hatalar öğrenmenin bir parçasıdır. Şimdi nerede eksik olduğunu keşfedip ilerleyelim!",
    "Zorlandığın noktalar aslında gelişmeye en açık alanların. Sabırlı ol, başaracaksın!",
    "Öğrenmek zaman alır, kendine zaman tanı. Küçük ilerlemeler bile çok değerlidir!",
    "Şu an zor geliyor olabilir ama unutma, her yanlış seni doğruya bir adım daha yaklaştırır.",
    "Denemeye devam et! Azim ve kararlılıkla her şeyin üstesinden gelebilirsin.",
    "Başlangıçlar hep zordur, ama en büyük başarılar da küçük adımlarla başlar.",
    "Emin ol, bu seviyeden yükselmek sandığından çok daha kolay olacak!",
    "Öğrenme sürecindesin ve bu sürecin en değerli kısmı sabırla devam etmektir.",
    "Şimdi eksiklerini fark ettin, işte bu bile büyük bir adım! Haydi devam edelim!"
  ],
  "20-40%": [
    "Başlangıcı yaptın, şimdi daha da güçlenme zamanı!",
    "Eksiklerini görmek, onları tamamlamanın ilk adımıdır. Devam et!",
    "Matematik, fizik veya tarih… Ne olursa olsun, tekrar ettikçe daha iyi anlayacaksın!",
    "İlerleme kaydediyorsun, bunu görmek harika! Daha fazla pratikle çok daha iyi olacaksın.",
    "Öğrenmenin en güzel yanı, her gün bir adım ileri gitmektir. Sen de bunu yapıyorsun!",
    "Bazı konular zorlayabilir ama pes etmezsen, kısa sürede farkı göreceksin!",
    "Şimdi eksiklerini belirleyip üzerine gidelim. Adım adım daha iyiye!",
    "Sen potansiyelinin farkında mısın? Biraz daha odaklanırsan harika işler çıkarabilirsin!",
    "Her soru, seni biraz daha geliştiriyor. Daha çok çöz, daha çok öğren!",
    "Çalışmalarının karşılığını almak için biraz daha sabır ve disiplin gerekiyor. Sen yapabilirsin!"
  ],
  "40-60%": [
    "Tebrikler! Artık orta seviyeye geldin, bu harika bir gelişme!",
    "Temelleri oturttun, şimdi biraz daha sıkı çalışarak daha da ileriye gidebilirsin!",
    "Daha fazla pratik yaparak eksiklerini kapatabilir ve başarıyı yakalayabilirsin!",
    "Soruların neredeyse yarısını doğru yapıyorsun, devam edersen çok daha iyi olacaksın!",
    "Hatalarından ders çıkarmaya devam edersen, hızla yükselirsin!",
    "Başarıya bir adım daha yaklaştın, biraz daha çaba ile zirveye ulaşabilirsin!",
    "Bu seviyeye gelmek bile büyük bir başarı. Şimdi daha fazla test çözerek sağlamlaştır!",
    "Senin için her şey daha anlaşılır olmaya başladı, devam et!",
    "İlerleme kaydediyorsun, şimdi biraz daha sabır ve motivasyonla devam!",
    "Küçük adımlarla büyük farklar yaratabilirsin, az kaldı!"
  ],
  "60-80%": [
    "Harikasın! Çoğu konuyu öğrenmişsin, ufak tefek eksikleri de tamamlayalım!",
    "İşin büyük kısmını hallettin, şimdi ustalaşma zamanı!",
    "Soruların çoğunu doğru yapıyorsun, bu harika! Daha da hızlanmak için çalışmaya devam et!",
    "Birkaç küçük dokunuşla çok daha iyi olabilirsin. Az kaldı, devam!",
    "Burası artık başarıya çok yakın olduğun nokta. Biraz daha çalış ve zirveye ulaş!",
    "Şimdiye kadar gösterdiğin çaba harika! Devam et, hedefe çok az kaldı!",
    "Artık işin püf noktalarını çözmeye başladın. Ufak tekrarlarla bilgileri pekiştirelim!",
    "Senin gibi kararlı biri için %80-%100 arası çok uzak değil. Biraz daha gayret!",
    "Testlerde daha yüksek netler yapabilmek için birkaç zorlu soruyla kendini test etmelisin!",
    "Bu seviyeye gelmek kolay değil! Şimdi biraz daha odaklanarak zirveye çıkma zamanı!"
  ],
  "80-100%": [
    "Muhteşem bir iş çıkardın! Şimdi bilgilerini koruyarak bu seviyeyi sürdürelim!",
    "Artık ustalaştın! Şimdi daha fazla pratikle hız kazanma zamanı.",
    "Senin gibi azimli biri için başarı kaçınılmaz! Tebrikler, harika bir performans!",
    "Sınavda büyük başarı elde etmeye çok yakınsın, biraz daha tekrar yaparak hatasız hale gelebilirsin!",
    "Soruların büyük kısmını doğru çözdün, sadece birkaç ayrıntıya dikkat ederek tam puana ulaşabilirsin!",
    "Mükemmel! Artık kendini geliştirmek için daha zor sorularla kendini test edebilirsin.",
    "Bu noktaya gelmek için çok çalıştın ve emeğinin karşılığını alıyorsun. Gurur duymalısın!",
    "Her denemede kendini daha da geliştiriyorsun. Harikasın!",
    "Sen zaten başardın! Artık bilgilerini daha sağlamlaştırma ve tekrar yapma zamanı.",
    "Büyük hedefler koymaya devam et! Senin için sınır yok, hep daha iyisini yapabilirsin!"
  ]
}